Repository: agencedps/ieseg-lp-2020
Catalog: languages/*.po
Languages: fr_fr

source: Page not found
fr_fr: Cette page n'existe pas

source: The page you are looking for may have been removed or renamed
fr_fr: La page que vous recherchez a été supprimée ou déplacée

source: But we can help you to get out of here
fr_fr: Mais nous pouvons vous aider à retrouver votre chemin

source: First of all, please double-check the spelling of the URL
fr_fr: Nous vous conseillons de vérifier l'adresse que vous avez saisie

source: If the problem remains, feel free to
fr_fr: Si le problème persiste, n'hésitez pas à

source: contact us
fr_fr: nous contacter

source: or go back to the
fr_fr: ou retournez sur la

source: Homepage
fr_fr: Page d'accueil

source: You can also try a search
fr_fr: Vous pouvez également effectuer une recherche

source: Look into these pages
fr_fr: Voir les pages suivantes

source: Discover IÉSEG
fr_fr: Découvrir l'École

source: View our programs
fr_fr: Voir nos programmes

source: Meet with us
fr_fr: Rencontrez-nous

source: Contact us
fr_fr: Contact

source: Leave us an email
fr_fr: E-mail

source: News
fr_fr: Actualités

source: All news
fr_fr: Toutes les actualités

source: Events
fr_fr: Evénements

source: All events
fr_fr: Tous les événements

source: Brochures
fr_fr: Plaquettes

source: Social Networks
fr_fr: Réseaux Sociaux

source: Map & Directions
fr_fr: Plan d'accès

source: Your browser does not support the video tag. Please upgrade your browser.
fr_fr: Votre navigateur ne peut pas afficher la vidéo. Nous vous recommandons de le mettre à jour.

source: Make the change
fr_fr: Rejoignez

source: and challenge yourself
fr_fr: la nouvelle culture du management international

source: A complete range of programs
fr_fr: Une gamme complète de programmes

source: Grande École Program
fr_fr: Programme Grande École

source: years
fr_fr: années

source: More information
fr_fr: Plus d'information

source: Bachelor Program
fr_fr: Programme Bachelor

source: Postgraduate Programs
fr_fr: Programmes MSc

source: months
fr_fr: mois

source: Executive Education
fr_fr: Formation Continue

source: Need information ?
fr_fr: Besoin d'informations

source: You are
fr_fr: Vous êtes

source: A prospective student
fr_fr: Un candidat

source: A parent
fr_fr: Un parent

source: A company
fr_fr: Une entreprise

source: An alumny
fr_fr: Un diplômé

source: Facts & Figures
fr_fr: L'IÉSEG en chiffres

source: students
fr_fr: étudiants

source: partner universities
fr_fr: universités partenaires

source: international professors
fr_fr: de professeurs internationaux

source: partner companies
fr_fr: entreprises partenaires

source: Rankings
fr_fr: Classements

source: Lille Campus
fr_fr: Campus de Lille

source: Discover
fr_fr: Découvrir

source: Paris Campus
fr_fr: Campus de Paris

source: Photo gallery
fr_fr: L'IÉSEG en images

source: Business classroom in paris
fr_fr: Salle de classe du campus de Lille

source: Business classroom in Lille
fr_fr: Salle de classe du campus de Lille

source: Graduation ceremony
fr_fr: Cérémonie de remise de diplôme de commerce post-bac

source: Students in courtyard
fr_fr: Etudiants dans la cour de l'IÉSEG

source: Students at works
fr_fr: Etudiants au travail

source: Follow IÉSEG on Instagram
fr_fr: Suivre l'IÉSEG sur Instagram

source: Testimonials
fr_fr: Témoignages

source: Keep reading
fr_fr: Lire la suite

source: No testimonial for this program
fr_fr: Pas de témoignage pour ce programme

source: All testimonials
fr_fr: Tous les témoignages

source: All the testimonials
fr_fr: Tous les témoignages

source: Left Menu
fr_fr: Menu de gauche

source: Left Menu for Pages Cibles
fr_fr: Menu de gauche pour les pages cibles

source: Menu for Programs homepages
fr_fr: Menu pour les homes de programmes

source: Menu for MSc Programs pages
fr_fr: Menu pour les pages programmes MSc

source: Menu for default MSc Programs pages (ie. not homepages)
fr_fr: Menu pour les pages programmes MSc (pas les homes)

source: Menu for IMBA Programs pages
fr_fr: Menu pour les pages programmes IMBA

source: Menu for default IMBA Programs pages (ie. not homepage)
fr_fr: Menu pour les pages programmes IMBA (pas les homes)

source: Search for
fr_fr: Rechercher

source: Our accreditations
fr_fr: Nos accréditations

source: Continue reading <span class="meta-nav">&rarr;</span>
fr_fr: Lire la suite <span class="meta-nav">&rarr;</span>

source: Search results
fr_fr: Resultats de recherche

source: result(s)
fr_fr: résultat(s)

source: Read more
fr_fr: En savoir plus

source: Sorry, your request returned 0 result
fr_fr: Désolé, votre recherche n'a donné aucun résultat

source: Click to open map in a new window
fr_fr: Cliquer pour ouvrir le plan dans une nouvelle fenêtre

source: Enlarge map
fr_fr: Agrandir le plan

source: In the same category
fr_fr: Dans la même catégorie

source: Research Agenda
fr_fr: Agenda de la recherche

source: All Research Events
fr_fr: Tous les événements de recherche

source: Class
fr_fr: Promotion

source: Position
fr_fr: Poste

source: Country
fr_fr: Pays

source: Read more testimonials about
fr_fr: Lire plus de témoignages sur le

source: Videos
fr_fr: Vidéos

source: Visit IÉSEG Youtube Channel
fr_fr: Visionner la chaine Youtube de l'IÉSEG

source: All photos
fr_fr: Toutes les photos

source: Fairs
fr_fr: Salons

source: City
fr_fr: Ville

source: Organizer
fr_fr: Organisateur

source: Open days
fr_fr: Journées Portes Ouvertes

source: Learn more
fr_fr: En savoir plus

source: Immersions
fr_fr: Demi-journées Immersion

source: Overview
fr_fr: Accueil

source: Scientific commitee opinion
fr_fr: L'avis du Conseil Scientifique

source: What our students
fr_fr: Nos étudiants

source: say
fr_fr: ont la parole

source: Read testimonial
fr_fr: Lire le témoignage

source: All testimonials about the
fr_fr: Tous les témoignages sur le
